-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 05, 2022 at 05:35 PM
-- Server version: 10.4.20-MariaDB
-- PHP Version: 8.0.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `digital_currency`
--

-- --------------------------------------------------------

--
-- Table structure for table `articles`
--

CREATE TABLE `articles` (
  `id` int(11) NOT NULL,
  `title` varchar(50) NOT NULL,
  `description` text NOT NULL,
  `image` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `articles`
--

INSERT INTO `articles` (`id`, `title`, `description`, `image`) VALUES
(1, 'استخراج بیت کوین', '<p>استخراج بیت کوین به دو روش ساده و سخت گیرانه وجود دارد؛ ساده ترین راه برای به دست آوردن بیت کوین خرید ساده آن در یکی از صرافی های مختلف است. برای راه سخت تر شما می توانید از &quot;استراتژی کلنگ&quot; استفاده کنید. این بر اساس یک روش قدیمی است که سرمایه گذاری هوشمندانه این نبود که طلا را جستجو کنیم، بلکه ساخت کلنگ های استخراج شده بود. یا به تعبیر مدرن، در شرکت هایی که این کلنگ ها را تولید می کنند سرمایه گذاری کنید. در زمینه ارزهای رمزنگاری شده مثل bitcoin معادل کلنگ، شرکتی است که تجهیزات مورد استفاده برای استخراج بیت کوین را تولید می کند.</p>\r\n\r\n<h2>استخراج ارز دیجیتال چیست؟</h2>\r\n\r\n<p>اصطلاح استخراج رمزنگاری به معنای به دست آوردن ارزهای رمزپایه از طریق حل معادلات رمزنگاری با استفاده از ماشینی مثل رایانه است. این فرایند شامل اعتبارسنجی بلوک های داده و افزودن سوابق معاملات به یک رکورد عمومی است که به عنوان بلاکچین شناخته می شود. بیت کوین و سایر ارزهای رمزپایه موجود در بازار برای ایجاد سکه های بیشتر از طریق فرایندی موسوم به &quot;استخراج&quot; تولید می شوند.</p>\r\n\r\n<p>استخراج علاوه بر پوشاندن جیب استخراج کنندگان و پشتیبانی از اکوسیستم بیت کوین، هدف حیاتی دیگری را نیز در اختیار دارد؛ این تنها راه آزاد کردن ارز رمز پایه جدید در گردش است. به عبارت دیگر، ماینرها در اصل &quot;ضرب&quot; ارز می کنند. در غیاب استخراج کنندگان، بیت کوین به عنوان یک شبکه همچنان وجود داشته و قابل استفاده است، اما هرگز بیت کوین اضافی وجود نخواهد داشت. سرانجام زمانی فرا می رسد که استخراج بیت کوین پایان می یابد. طبق پروتکل بیت کوین، تعداد کل بیت کوین 21 میلیون خواهد بود. با این حال، به دلیل اینکه میزان &quot;استخراج&quot; بیت کوین با گذشت زمان کاهش می یابد، بیت کوین نهایی تا حدود سال 2140 منتشر نخواهد شد.</p>\r\n\r\n<h2>مراحل استخراج بیت کوین</h2>\r\n\r\n<p>برای ماینینگ بیت کوین، رایانه هایی با قدرت بالا در سراسر جهان مسائل پیچیده ریاضی محاسباتی را حل می کنند و به عنوان پاداش bitcoin کسب می کنند. برای کسب بیت کوین باید دو شرط را داشته باشید؛ یکی مسئله تلاش است و یکی مسئله شانس است. 1) شما باید تراکنش های ارزش 1 مگابایت را تأیید کنید که این بخش آسان است. 2) شما باید اولین معدنچی باشید که به یک جواب صحیح یا نزدیک ترین پاسخ به یک مسئله عددی می رسید. این روند همچنین به عنوان اثبات کار شناخته می شود.</p>\r\n\r\n<h2>کیف پول بیت کوین</h2>\r\n\r\n<p>کیف پول بیت کوین یک برنامه نرم افزاری است که بیت کوین در آن ذخیره می شود. از نظر فنی، بیت کوین در هیچ جایی ذخیره نمی شود. برای هر شخصی که موجودی کیف پول بیت کوین را دارد، یک کلید خصوصی (شماره مخفی) متناسب با آدرس بیت کوین آن کیف پول وجود دارد. کیف پول های بیت کوین ارسال و دریافت بیت کوین را تسهیل می کنند و مالکیت مانده بیت کوین را به کاربر می دهند. کیف پول بیت کوین انواع مختلفی دارد. چهار نوع اصلی شامل دسکتاپ، موبایل، وب و سخت افزار است.</p>\r\n\r\n<h2>تجهیزات برقی مناسب</h2>\r\n\r\n<p>یک تجهیزات استخراج ایده آل در حالی که تقریباً برق صفر مصرف می کنید، هشدار فوق العاده خوبی را ارائه می دهد. البته، در دنیای واقعی امکان پذیر نیست، اما سخت افزار استخراج بیت کوین یعنی تجهیزات مورد علاقه نزدیک به کامل وجود دارد. باید یک دلیل منطقی و عملی در انتخاب ماینر بیت کوین در نظر داشت زیرا نمی توان یک دستگاه استخراج را به آسانی تغییر داد.</p>\r\n\r\n<h2>چقدر می توانیم درآمد کسب کنیم؟</h2>\r\n\r\n<p>چهار عامل اساسی برای تعیین سودآوری بیت کوین وجود دارد: 1. Bitcoin price: منظور قیمت بیت کوین است؛ از آنجا که قیمت بیت کوین کاملاً غیرقابل کنترل است، می توانید برای شروع یک کار استخراج معادن، ارزش بلند مدت آن را تجزیه و تحلیل کنید. البته، این یک عامل حیاتی است؛ بنابراین در مورد انتظارات قیمت در آینده فکر کنید. 2.: Miner hashrate این کارایی یا سرعت استخراج کننده برای حل مشکلات شبکه بیت کوین است. استخراج کننده مشکلات بلوک یا محاسبات پیچیده ریاضی را برای یافتن بلوک های بعدی در شبکه حل می کند. یک استخراج کننده با سرعت بالا شانس زیادی برای حل مشکلات، مهر و موم کردن بلوک ها و در نتیجه جمع آوری پاداش های بلوک دارد. 3. Network hashrate: این کارایی یا سرعت شبکه برای حل مشکلات است، به عنوان مثال، سرعت های استخراج کنندگان متصل به شبکه، شبکه بیت کوین استخراج کنندگان اضافی را با گذشت زمان جلب می کند. بنابراین، مشکل استخراج به طور مداوم افزایش می یابد، و سود شما را با گذشت زمان کاهش می دهد. 4. Electricity pricing: منظور قیمت گذاری برق است؛ ASIC ها برای انجام محاسبات مورد نیاز به مقدار زیادی برق نیاز دارند. اگر در یک کشور یا منطقه ای زندگی کنید که هزینه برق زیاد است، می تواند حاشیه سود شما را کاهش دهد. البته، استخراج کنندگان متنوع از مقدار متفاوتی از برق در هر دستگاه استفاده می کنند.</p>\r\n\r\n<h2>سخن پایانی</h2>\r\n\r\n<p>سرمایه گذاری در بیت کوین پیچیده به نظر می رسد، اما اگر آن را به صورت مرحله ای تقسیم کنید، بسیار آسانتر است. خرید بیت کوین روز به روز آسانتر می شود و همچنین مشروعیت مبادلات و کیف پول ها نیز در حال افزایش است. بیت کوین حضور فیزیکی ندارد، بنابراین نمی توانید با قفل کردنش در صندوق امانات یا دفن آن در جنگل، از آن محافظت کنید. در استخراج بیت کوین علی رغم کاملاً عمومی بودن، دستکاری در بیت کوین بسیار دشوار است. تمام معاملات بیت کوین به صورت عمومی و دائمی در شبکه ذخیره می شوند، به این معنی که هرکسی می تواند موجودی و تراکنش های هر آدرس بیت کوین را مشاهده کند. با این حال، هویت کاربر در پشت یک آدرس ناشناخته باقی می ماند تا زمانی که اطلاعات در هنگام خرید یا در شرایط دیگر مشخص شود. این یکی از دلایلی است که آدرس های بیت کوین فقط یکبار باید استفاده شود.</p>\r\n', '16444322352.jpg'),
(2, 'آشنایی با اتریوم', '<p>برای آشنایی با اتریوم باید بدانید اتریوم خود را &quot;بلاک چین قابل برنامه ریزی جهان&quot; توصیف می کند. اتریوم ادعا می کند که پلتفرم آن می تواند برای &quot;کدگذاری ، تمرکززدایی ، ایمن سازی و تجارت تقریباً همه چیز&quot; استفاده شود. اتریوم چیست ؟ اتریوم یک پلتفرم مبتنی بر بلاک چین است که به عنوان یک شبکه بلاک چین ، یک دفتر عمومی غیر متمرکز برای تأیید و ثبت تراکنش ها است.برای آشنایی با اتریوم کاربران شبکه می توانند برنامه های کاربردی را در این پلتفرم ایجاد ، منتشر ، درآمدزایی و استفاده کنند و از ارز رمزنگاری شده Ether آن به عنوان پرداخت استفاده کنند. اتر چیست ؟ اتریوم دارای ارز رمزنگاری شده خاص خود ، اتر یا ETH است. ارز دیجیتال اتر برای استفاده در شبکه اتریوم طراحی شده است.این ارز نوعی توکن است که برای تکمیل تراکنش های بلاک چین استفاده می شود.</p>\r\n\r\n<h2>آشنایی با اتریوم2.0</h2>\r\n\r\n<p>برای آشنایی با اتریوم 2.0 بدانید اتریوم می خواهد بستری برای انواع برنامه های کاربردی باشد که می تواند اطلاعات را با خیال راحت ذخیره کند. به جای استخراج ، که انرژی زیادی می طلبد ، اتریوم 2.0 حرکت به سمت الگوریتم اجماع PoS را مشخص می کند. اثبات سهام، جایگزین استخراج کنندگان با اعتبارسنج ها می شود: کاربرانی که بلاک چین اتریوم را ذخیره می کنند ، تراکنش ها را تأیید می کنند و موارد دیگر.</p>\r\n\r\n<h2>اتریوم چگونه کار می کند؟</h2>\r\n\r\n<p>بلاک چین اتریوم برای کشف بلاک های جدید به استخراج کنندگان متکی است. اینها مانند جعبه های دیجیتالی هستند که اطلاعات معاملات و سایر داده ها را ذخیره می کنند.در آشنایی با اتریوم استخراج کنندگان با استفاده از تجهیزات محاسباتی تخصصی رقابت می کنند تا شانس این را داشته باشند که نفر بعدی باشند که یک بلوک به زنجیره اضافه می کنند و با هزینه تراکنش (از معاملاتی که به بلوک اضافه می کنند) و &quot;پاداش بلاک&quot; پاداش می گیرند. پاداش بلاک، سکه های اتر جدیدی هستند که با کشف هر بلوک جدید ایجاد می شوند و به خاطر تلاش ها به ماینر موفق داده می شود. هنگامی که یک بلوک اضافه می شود ، بقیه شبکه ماینینگ آن را تأیید می کند تا مطمئن شود که موجودی ها درست است و معامله دوبار هزینه نمی شود. سپس گره های کامل اطلاعات نهایی را ثبت می کنند.</p>\r\n\r\n<h2>قرارداد هوشمند اتریوم چیست؟</h2>\r\n\r\n<p>یکی از جذاب ترین موارد آشنایی با اتریوم قرارداد هوشمند است.&quot;قرارداد هوشمند&quot; صرفاً برنامه ای است که بر روی بلاک چین اتریوم اجرا می شود. این مجموعه ای از کد (توابع آن) و داده ها (وضعیت آن) است که در آدرس خاصی در بلاک چین اتریوم قرار دارد. قراردادهای هوشمند نوعی حساب اتریوم هستند یعنی می توانند تراکنش ها را از طریق شبکه ارسال کنند. با این حال ، آنها توسط کاربر کنترل نمی شوند و در شبکه مستقر شده و به صورت برنامه ریزی شده، قواعد یک قرارداد را از طریق کد اجرا می کنند.</p>\r\n\r\n<h2>ماشین مجازی اتریوم چیست؟</h2>\r\n\r\n<p>ماشین مجازی اتریوم یک پشته مجازی قدرتمند و سندباکس است که در هر گره کامل اتریوم تعبیه شده و وظیفه اجرای کد بایتی قرارداد را بر عهده دارد. قراردادها به طور معمول به زبانهای سطح بالاتر مانند Solidity نوشته می شوند و سپس به کد بایت EVM کامپایل می شوند. ماشینهای مجازی اتریوم با موفقیت در زبانهای برنامه نویسی مختلف از جمله C ++ ، جاوا ، جاوا اسکریپت ، پایتون ، روبی و بسیاری دیگر استفاده شده است.</p>\r\n\r\n<h2>تفاوت اتریوم و بیت کوین چیست؟</h2>\r\n\r\n<p>کاربرد اصلی بیت کوین به عنوان ارز مجازی و ذخیره ارزش است. اتر همچنین به عنوان یک ارز مجازی و ذخیره ارزش عمل می کند ، اما شبکه غیر متمرکز اتریوم امکان ایجاد و اجرای برنامه ها ، قراردادهای هوشمند و سایر تراکنش ها را در شبکه فراهم می کند. بیت کوین این توابع را ارائه نمی دهد. فقط از آن به عنوان ارز و ذخیره ارزش استفاده می شود. نکته: &quot;بلاک های جدید هر 10 دقیقه یکبار در شبکه بیت کوین و در بلاک های جدید در شبکه اتریوم هر 12 ثانیه یکبار اعتبار می یابند.&quot; در آشنایی با اتریوم پس اتریوم تراکنش ها را سریعتر پردازش می کند.</p>\r\n\r\n<h2>سخن پایانی</h2>\r\n\r\n<p>در آشنایی با اتریوم دیدیم که اتریوم پس از بیت کوین از نظر ارزش بازار در رتبه دوم قرار دارد. اما چیزی که در مورد آشنایی با اتریوم منحصر به فرد است این است که کاربران می توانند برنامه هایی بسازند که روی بلاک چین اجرا می شوند ، مانند نرم افزاری که روی کامپیوتر اجرا می شود. این برنامه ها می توانند داده های شخصی را ذخیره و منتقل کنند یا تراکنش های مالی پیچیده ای را انجام دهند.</p>\r\n', '1644432394ethereum.jpg'),
(3, 'استخراج ابری', '<p>برخلاف استخراج سنتی ارزهای رمزنگاری شده که مشکلات قابل توجهی را شامل می شود، استخراج ابری فرصتی منحصر به فرد برای شروع کسب درآمد به کاربران می دهد. استخراج ابری به شما امکان می دهد بدون نگهداری تجهیزات از توان محاسباتی تجهیزات استخراج در مراکز داده تخصصی استفاده کنید و ثروتمند شوید. استخراج ابری مکانیسمی برای استخراج ارز دیجیتال مانند بیت کوین با استفاده از قدرت رایانش ابری اجاره ای و بدون نیاز به نصب و اجرای مستقیم سخت افزار و نرم افزارهای مرتبط است. شرکت های ماینینگ ابری به مردم اجازه می دهند حساب باز کنند و از راه دور در روند استخراج ارزهای رمزنگاری شده با یک هزینه اساسی شرکت کنند. آنها استخراج را برای تعداد بیشتری از مردم در سراسر جهان قابل دسترسی می کنند.</p>\n\n<h2>استخراج ابری چیست؟</h2>\n\n<p>ابر استخراج از رایانش ابری برای تولید ارزهای رمزپایه مبتنی بر بلاکچین استفاده می کند. رایانش ابری، یکی از سریع ترین روندهای رشد فناوری است که در آن سرویس های محاسباتی مانند پردازش، ظرفیت سرور، نرم افزار و ذخیره سازی فایل از طریق ابر و اینترنت قابل دسترسی هستند. چنین شرکت هایی بر اساس میزان استفاده هزینه می گیرند، مانند هزینه های استفاده از آب یا برق ما. از طرف دیگر، استخراج ستون فقرات مدل ارزهای رمزپایه مانند بیت کوین است. این فرایندی است که طی آن تراکنش ها تأیید و به دفتر عمومی اضافه می شوند، که به عنوان بلاکچین شناخته می شود. همچنین وسیله ای است که از طریق آن سکه های جدید آزاد می شود.</p>\n\n<h2>مدل ها و تکنیک های استخراج ابری</h2>\n\n<p>مدل های محبوب استخراج ابری شامل استخراج میزبان و قدرت هش اجاره ای است. استخراج میزبان محبوب ترین شکل استخراج ابری یا کلود ماینینگ است. در این مدل، مشتری تجهیزات سخت افزاری معدن واقع در تأسیسات معدن را خریداری یا اجاره می کند. ماینر وظیفه نگهداری تجهیزات و اطمینان از عملکرد آنها را بر عهده دارد. از طریق این مدل، مشتریان کنترل مستقیم ارز رمزنگاری شده خود را دارند. اقتصاد مقیاس یک مزرعه معدنی تضمین می کند که هزینه های گران مربوط به استخراج از جمله برق، ذخیره و قابل کنترل است. اما هزینه پیش پرداخت قابل توجهی در رابطه با این نوع استخراج وجود دارد. قدرت هش اجاره ای مدل دیگری است که در استخراج ابری استفاده می شود. در این مدل، قدرت هش یا قدرت محاسباتی مرتبط با ارز رمزنگاری شده از یک مزرعه استخراج می شود. مشتریان سهمی از سود کلی مزرعه را از استخراج ارزهای رمزپایه دریافت می کنند. براساس گزارش ها، قدرت هش اجاره ای شکل معروف استخراج برای آلت کوین ها (به عنوان مثال ارزهای رمزنگاری شده غیر از بیت کوین) است. این فرایند به شخص نیاز دارد تا از طریق وبسایت خود در یک شرکت استخراج ابری حساب باز کند و موارد خاصی مانند دوره قرارداد و قدرت هش را انتخاب کند.</p>\n\n<h2>مزایا و معایب استخراج ابری چیست؟</h2>\n\n<p>مزایای استخراج ابری این است که هزینه های کلی مربوط به استخراج را کاهش می دهد و به سرمایه گذاران روزمره، که ممکن است دانش فنی کافی نداشته باشند، اجازه استخراج ارزهای رمزپایه را می دهند. همچنین نیاز به خرید سخت افزار نیست و بدون گرما و بدون سر و صدا به استخراج می پردازند. از معایب استخراج ابر این است که این روش استخراج معادن را برای مزارع متمرکز می کند و سود آن در معرض تقاضا است. دقت کنید هر شرکتی که آزمایشات رایگان ارائه دهد، به خصوص اگر به اطلاعات پرداختی نیاز داشته باشد، به احتمال زیاد کلاهبرداری است.</p>\n\n<h2>تفاوت استخراج استخر و استخراج ابری چیست؟</h2>\n\n<p>در هر دو مورد شما با یک شخص ثالث کار می کنید: با استخراج استخر، شما به دکل استخراج خود نیاز دارید و از طریق استفاده از نرم افزار استخر، قدرت پردازش دکل استخراج خود را به عملیات استخراج کمک می کنید. شما باید با خرید و مدیریت تجهیزات، راه اندازی تجهیزات، خنک کردن تجهیزات، دائمی و ثابت بودن اتصال اینترنت و غیره کنار بیایید. با استخراج ابری، شما اساساً یک سرمایه گذار در یک عملیات استخراج هستید. تمام آنچه شما فراهم می کنید پول است. شرکت های استخراج از طریق ابر، هزاران نفر را برای سرمایه گذاری مبالغ مختلف در این عملیات ثبت نام می کنند و در ازای این کار از درآمد خود استفاده می کنند.</p>\n\n<h2>استخراج ابری در ایران</h2>\n\n<p>اشتیاق برای استخراج ارزهای رمزنگاری شده همچنان پابرجاست، اگرچه مشکل استخراج رو به افزایش است. دشواری الگوریتم های ارزهای رمزنگاری شده و مشکلات تجهیزات نگهداری شده، تمایل به استخراج ابری را بالا برده است. باید یک عملیات استخراج ابر معتبر پیدا کنید. البته باید به شرایط و ضوابط ارائه دهنده خدمات در مورد &quot;هشدارهای قراردادی&quot; توجه زیادی داشته باشید.</p>\n\n<h2>سخن پایانی</h2>\n\n<p>استخراج ابری فرصتی منحصر به فرد برای شروع استخراج است چون نیازی به نگهداری سخت افزار استخراج نیست. این فرآیند مستلزم آن است که شخصی از طریق وبسایت در یک شرکت استخراج ابری حساب باز کند و موارد خاصی مانند دوره قرارداد و قدرت هش را انتخاب کند. همچنین استخراج ابر سودآورترین سرمایه گذاری برای شما است.</p>\n', '1644432415abri.jpg'),
(4, 'ارز دیجیتال چیست؟', '<p>ارز دیجیتال نوعی وجه است که می تواند به صورت آنلاین با کالاها و خدمات مبادله شود. تعداد زیادی شرکت ها ارزهای خاص خود را صادر کرده اند که اغلب به آنها توکن می گویند. این معاملات را می &zwnj;توان به طور خاص برای کالا یا خدماتی که شرکت ارائه می دهد معامله کرد. برای دسترسی به کالا یا خدمات، باید ارز واقعی را با ارز دیجیتال صرافی کنید. آموزش ارز دیجیتال با استفاده از فناوری بلاکچین است. بلاکچین فناوری &zwnj;ای غیرمتمرکز است که در بسیاری از کامپیوترها پخش شده و تریدها را مدیریت و ثبت می کند. بخشی از جذابیت فناوری بلاکچین امنیت آن است.</p>\r\n\r\n<h2><strong>بهترین صرافی های ارز دیجیتال</strong></h2>\r\n\r\n<p>صرافی های ارز دیجیتال مشاغلی هستند که به مشتریان امکان می &zwnj;دهند ارزی را با ارز دیگر مبادله کنند. مبادلات ارزی را می توان در مکان های فیزیکی، مانند بانک ها یا فرودگاه ها یافت، اما به طور فزاینده ای در اینترنت رایج است. هزینه های صرافی بقدری متفاوت است که هزینه کارت اعتباری ممکن است از کارمزد پرداخت شده از طریق نرخ ارز تعدیل شده کمتر باشد</p>\r\n\r\n<h2><strong>چند ارز دیجیتال وجود دارد؟</strong></h2>\r\n\r\n<p>بر اساس یک وبسایت تحقیقات بازار، بیش از 10 هزار ارز رمزپایه مختلف به صورت عمومی معامله می &zwnj;شود. ارزهای رمزنگاری شده همچنان تکثیر می شوند و از طریق پیشنهادات اولیه، کوین یا ICO پول جمع می کنند. ارزش کل ارزهای رمزنگاری شده طبق CoinMarketCap در 27 مه 2021 بیش از 1.7 تریلیون دلار بود، از بالاترین قیمت آوریل 2.2 تریلیون دلار کمتر است. ارزش کل بیت کوین، محبوب&zwnj;ترین ارز دیجیتال، در حدود 735 میلیارد دلار ثابت شد، از بالاترین رقم آوریل 1.2 تریلیون دلار پایین&zwnj;تر است</p>\r\n\r\n<h2><strong>آیا ارزهای رمزپایه محبوبیت بسیار دارند؟</strong></h2>\r\n\r\n<p>ارزهای رمزنگاری شده به دلایل مختلف طرفداران خود را جلب می کنند. در اینجا برخی از محبوب ترین ها وجود دارد: 1. حامیان ارزهای رمزنگاری شده مانند بیت کوین را به عنوان ارز آینده می دانند و احتمالاً قبل از ارزشمندتر شدن آنها در حال خرید آنها هستند. 2. بعضی از طرفداران ارز دیجیتال این واقعیت را دوست دارند که ارزرمز بانک&zwnj;های مرکزی را از مدیریت عرضه پول حذف می کند، زیرا با گذشت زمان این بانک ها میل به کاهش ارزش پول از طریق تورم دارند. 3. طرفداران دیگر مانند فناوری بلاکچین ارزهای رمزنگاری شده، ارزهای دیجیتال یک سیستم پردازش و ضبط غیرمتمرکز است و می&zwnj;تواند ایمن تر از سیستم های پرداخت سنتی باشد. 4. بعضی از دلالان، ارزهای رمزنگاری شده را در آموزش ارز دیجیتال در اصفهان دوست دارند زیرا ارزش آنها افزایش می یابد و علاقه&zwnj;ای به پذیرش طولانی مدت ارزها به منظور راهی برای جابجایی پول ندارند.</p>\r\n\r\n<h2><strong>استراتژی سرمایه&zwnj;گذاری در ارز دیجیتال</strong></h2>\r\n\r\n<p>ارزهای رمزپایه ممکن است از ارزش ببشتری برخوردار شوند، اما تعداد زیادی از سرمایه &zwnj;گذاران آنها را صرفاً حدس و گمان می دانند و سرمایه گذاری واقعی نمی بینند. دلیل؟ درست مثل ارزهای واقعی، ارزهای رمزپایه هیچ جریان نقدی ایجاد نمی کنند، بنابراین برای سودآوری شما، کسی باید هزینه بیشتری نسبت به پول شما برای ارز بپردازد. این همان چیزی است که تئوری سرمایه &zwnj;گذاری در آموزش ارز دیجیتال در اصفهان &quot;نادانی بزرگتر&quot; نامیده است. تئوری سرمایه گذاری را در برابر تجارت خوب مدیریت شده قرار دهید، که با افزایش سود و جریان نقدی عملیات، ارزش آن را به مرور بالا می&zwnj;برد. برای افرادی که ارزهای رمزپایه در آموزش ارز دیجیتال در اصفهان مانند بیت کوین را به عنوان ارز دیجیتال آینده می بینند، باید دقت داشته باشید که یک ارز به ثبات نیاز دارد. برای کسانی که ارز دیجیتال مانند بیت کوین را به عنوان واحد پول آینده می&zwnj;دانند، باید توجه داشت که یک ارز به ثبات نیاز دارد تا تریدرها و مشتریان بتوانند قیمت مناسب کالاها را معین کنند. بیت کوین و سایر ارزهای رمزپایه در بیشتر تاریخ خود ثبات نداشته اند. به عنوان مثال، در حالیکه بیت کوین در دسامبر 2017 نزدیک به 20 هزار دلار معامله می کرد، ارزش آن پس از آن به حدود 3200 دلار در سال بعد کاهش یافت. در دسامبر سال 2020، دوباره در سطح رکورد معاملات انجام می شد.</p>\r\n\r\n<h2><strong>ICO شناسایی و سرمایه گذاری در</strong></h2>\r\n\r\n<p>اگر می خواهید ارز رمزنگاری شده را در ICO بخرید، اطلاعات مناسب را در دفترچه شرکت بخوانید: چه کسی مالک شرکت است؟ یک مالک قابل شناسایی و شناخته شده نشانه مثبت است. آیا سرمایه گذاران عمده دیگری نیز در آن سرمایه &zwnj;گذاری می کنند؟ اگر سایر سرمایه گذاران معروف قطعه ای از ارز را بخواهند، نشانه خوبی است. آیا در این شرکت سهمی خواهید داشت یا فقط ارز دیجیتال یا توکن دارید؟ این تمایز مهم است. داشتن یک سهم به معنای مشارکت در درآمد آن است (شما یک مالک هستید)، در حالی که خرید توکن به این معنی است که شما حق استفاده از آنها را دارید، مانند تراشه های موجود در کازینو. آیا ارز دیجیتال از قبل گسترش یافته است یا این شرکت به دنبال جمع&zwnj; پول برای توسعه آن است؟ هرچه در راستای محصول بیشتر باشد، ریسک کمتری نیز دارد. بررسی از طریق اطلاعیه می &zwnj;تواند زیاد طول بکشد. هرچه جزئیات بیشتری داشته باشد، شانس بیشتری دارد که مجاز باشد. اما حتی مشروعیت به معنای موفقیت ارز نیست. این سوال کاملاً جداگانه &zwnj;ای است و این سوال نیاز به زیرکی زیادی در بازار دارد. اما فراتر از این نگرانی ها، فقط داشتن ارز رمزنگاری شده شما را در معرض خطر سرقت قرار می دهد، زیرا هکرها سعی می کنند به شبکه های رایانه &zwnj;ای که دارایی های شما را حفظ می کنند نفوذ کنند. صرافی معروفی در سال 2014 پس از دزدیدی هکرها از صدها میلیون دلار بیت کوین، اعلام ورشکستگی کرد. اینها خطرات عادی برای سرمایه گذاری در سهام و وجوه در مبادلات عمده ایالات متحده نیستند.</p>\r\n\r\n<h2><strong>سخن پایانی</strong></h2>\r\n\r\n<p>آموزش ارز دیجیتال و درک درست آن به شما کمک می کند تا از انواع، ماهیت، قوانین و هرآنچه که ضروری است قبل از ورود به بازار ارزهای دیجیتال بدانید اطلاع یابید و در این مارکت موفق شوید. تا بتوانید با شناخت صحیح و اطلاعات کامل از ارزهای دیجتال در خرید و فروش به موقع آن، سودی مناسب بدست آورید. همچنین این فناوری جدید، روش معاملات را با تغییر اساسی روبرو خواهد کرد.</p>\r\n', '1644432440arzdigital.jpg'),
(5, 'انواع ارز دیجیتال', '<p>انواع ارزهای دیجیتال که شامل آلت کوین و توکن هستند می توانند مانند پول واقعی عمل کنند اما شکل پولی دیجیتالی دارند و توسط هیچ مرجع مرکزی مدیریت و اداره نمی شوند. یک محصول واقعی از عصر دیجیتال، ارزهای رمزپایه بدون دخالت بانک ها، دولت ها یا هیچ واسطه ای فعالیت می کنند. آنچه امنیت را فراهم می کند رمزگذاری ارزها با کد رایانه ای ویژه ای است که رمزنگاری نامیده می شود. آنها مانند یک معمای پیچیده طراحی شده اند به طوری که شکستن آنها سخت است.</p>\r\n\r\n<h2>انواع مختلف ارز دیجیتال</h2>\r\n\r\n<p>ارزهای رمزنگاری به طور کلی در یکی از دو دسته قرار می گیرند: &bull; سکه هایی که می توانند شامل بیت کوین و آلت کوین (ارزهای رمزپایه غیر بیت کوین) باشند. &bull; توکن ها</p>\r\n\r\n<p>آلت کوین به هر ارزی که بیت کوین نباشد اشاره دارد. بیت کوین یک ارز دیجیتال محبوب است که با راه حل های محاسباتی برای مسائل پیچیده ریاضی تولید می شود. نام &quot;&quot;altcoin در واقع به معنای &quot;جایگزین بیت کوین&quot; است. برخی از انواع اصلی آلت کوین شامل ارزهای رمزپایه مبتنی بر استخراج، پول های پایدار، رمزهای امنیتی است. Namecoin اولین altcoin است که در سال 2011 ایجاد شده است. مانند بیت کوین، اکثر ارزهای رمزپایه ای آلت کوین، سکه محدودی دارند. آلت کوین و سکه مترادف هستند که برای مراجعه به ارزهای رمزپایه استفاده می شوند.</p>\r\n\r\n<h2>تفاوت آلت کوین ها و بیت کوین چیست ؟</h2>\r\n\r\n<p>اگرچه بیشتر آلت کوین ها بر اساس همان چارچوب اساسی بیت کوین ساخته شده اند. هر کدام طعم موفقیت های مختلفی را چشیده اند هر سیستم می تواند با سیستم دیگر متفاوت باشد، زیرا برای تأمین اهداف و برنامه های مختلف ایجاد شده و به روش های مختلف شناسایی شده است. Altcoins برای ایجاد یک مزیت رقابتی، محدودیت های درک شده Bitcoin را بهبود می بخشد. چندین آلت کوین از روشی برای به حداقل رساندن مصرف انرژی و زمان مورد نیاز برای ایجاد بلوک و اعتبارسنجی معاملات جدید استفاده می کنند.</p>\r\n\r\n<h2>(TOKENS)توکن ها</h2>\r\n\r\n<p>برخلاف altcoins، توکن ها از طریق یک پیشنهاد اولیه سکه یا ICO ایجاد می شوند و به آن ها داده می شود، تقریباً مشابه پیشنهاد سهام. آن ها می توانند به صورت زیر نمایش داده شوند: &bull; رمزهای ارزشی (بیت کوین) &bull; رمزهای امنیتی (برای محافظت از حساب خود) &bull; علامت های نرم افزاری (تعیین شده برای کاربردهای خاص)</p>\r\n\r\n<h2>هدف توکن چیست؟</h2>\r\n\r\n<p>توکن ها می توانند برای نشان دادن سهام یک سرمایه گذار در شرکت استفاده شوند یا می توانند برای اهداف اقتصادی مورد استفاده قرار گیرند، دقیقاً مانند دادخواست قانونی. این بدان معناست که دارندگان توکن می توانند از آنها برای خرید استفاده کنند یا می توانند مانند سایر اوراق بهادار برای سودآوری توکن ها را معامله کنند. قرار نیست آن ها به اندازه پول استفاده شوند بلکه برای توصیف یک عملکرد استفاده می شود. آن ها مانند دلار آمریکا ارزش را نشان می دهند اما به خودی خود ارزش ندارند. توکن ها نوعی رمزگذاری هستند که به طور خاص به صف های طولانی اعداد و حروف نشان دهنده رمزنگاری استفاده شده در معامله، مانند انتقال پول یا پرداخت قبض اشاره دارد.</p>\r\n\r\n<h2>متداول ترین انواع ارزهای رمزپایه</h2>\r\n\r\n<p>1. Bitcoin: بیت کوین نوعی ارز دیجیتال است؛ به طور خاص، این ارز رمزنگاری شده در نظر گرفته شده است زیرا رمزنگاری، ایجاد و معاملات بیت کوین را تسهیل می کند. در حال حاضر بیش از 18.5 میلیون رمز بیت کوین در حال گردش است، در حالی که محدودیت فعلی 21 میلیون وجود دارد. 2. Bitcoin Cash: بیت کوین کش در سال 2017 معرفی شد، یکی از محبوب ترین انواع ارزهای رمزپایه در بازار است. تفاوت اصلی آن با بیت کوین اصلی اندازه بلوک آن است: 8 مگابایت. اندازه بلاک Bitcoin اصلی که فقط 1 مگابایت است این برای کاربران به معنی سرعت پردازش سریعتر است. 3. Litecoin لایت کوین به طور فزاینده ای در همان نفس بیت کوین استفاده می شود، و عملکرد آن تقریباً به همان شیوه است. در سال 2011 توسط چارلی&not;لی، کارمند سابق گوگل ایجاد شد. او آن را برای بهبود فناوری بیت کوین طراحی کرده است، با زمان معامله کوتاه تر، کارمزد کمتر، استخراج کنندگان متمرکزتر. 4. Ethereum: برخلاف بیت کوین، اتریوم به اندازه برنامه های غیرمتمرکز روی ارز دیجیتال تمرکز ندارد. می توانید اتریوم را به عنوان یک فروشگاه برنامه در نظر بگیرید. این پلتفرم در تلاش است تا کنترل برنامه ها را به سازندگان اصلی خود بازگرداند و این کنترل را از واسطه ها بگیرد. تنها شخصی که می تواند در برنامه تغییراتی ایجاد کند، سازنده اصلی است. نشانه ای که در اینجا استفاده می شود Ether نام دارد که توسط توسعه دهندگان برنامه و کاربران به عنوان ارز استفاده می شود. 5. Ripple :ریپل یکی از انواع ارزهای رمزپایه است، اما مبتنی بر Blockchain نیست. این مورد برای کاربران فردی بیشتر نیست بلکه برای شرکت های بزرگتر است، که مبالغ بیشتری را به پول منتقل می کنند (سکه آن را XRP می نامند) در سراسر جهان. 6. Stellar: تمرکز Stellar بر نقل و انتقالات پول است و شبکه آن به گونه ای طراحی شده است که حتی در مرزهای ملی نیز سریعتر و کارآمدتر می شود. این توسط Jed McCaleb، بنیان گذار Ripple در سال 2014 طراحی شده است و توسط یک سازمان غیرانتفاعی به نام Stellar.org اداره می شود. 7. NEO: که قبلاً Antshares نامیده می شد و در چین توسعه یافته بود، بسیار تهاجمی به دنبال تبدیل شدن به یک بازیکن رمزگذاری جهانی بزرگ است. تمرکز آن قراردادهای هوشمند (قراردادهای دیجیتال) است که به کاربران امکان می دهد بدون استفاده از واسطه توافق نامه هایی ایجاد و اجرا کنند.</p>\r\n\r\n<h2>سخن پایانی</h2>\r\n\r\n<p>انواع ارزهای دیجیتال از مهیج ترین گزینه های سرمایه گذاری در بازارها را ارائه می دهند. اکنون که با انواع مختلف ارزهای رمزپایه آشنا شدید به عنوان سرمایه گذارانی که به دنبال ایجاد تنوع در بازارهای رمزنگاری هستید، باید ارزهایی را انتخاب کنید که بازدهی بالایی دارند.</p>\r\n', '1644432480anvaearz.jpg'),
(6, 'بلاکچین چیست؟', '<p>برای آنکه با مفهوم تکنولوژی بلاکچین آشنا شوید اول باید بدانید بلاکچین چیست؟ بلاکچین (Blockchain) به زنجیره ای از بلاک ها گفته می شود که سیستمی برای ثبت و ضبط داده ها است. این داده ها می تواند در تراکنش های بانکی، اسناد مالکیت، قراردادها هوشمند، پیام های شخصی یا دیگر اطلاعات باشد. ویژگی جذاب زنجیره بلاکی این است که کار ذخیره این داده ها بدون وجود یک مدیر و صاحب اختیار مرکزی امکان پذیر است و نمی توان با تخریب یک نقطه مرکزی داده های ذخیره شده را تحریف یا نابود کرد.</p>\r\n\r\n<h2>بلاکچین به زبان ساده</h2>\r\n\r\n<p>بلاکچین در واقع یک سند دیجیتالی است که در کل شبکه سیستم های رایانه ای موجود در بلاکچین تکثیر و توزیع می شود. هر بلوک در این زنجیره شامل تعدادی معامله است و هر بار که یک معامله جدید در بلاکچین اتفاق می افتد، رکوردی از آن معامله به سند کل شرکت کنندگان اضافه می شود. در اصل به&zwnj;منظور زمان بندی اسناد دیجیتال به وجود آمده تا دیگر امکان تغییر تاریخ و دست بردن داخل وجود نداشته باشد.</p>\r\n\r\n<h2>تفاوت بلاکچین با اینترنت عادی</h2>\r\n\r\n<p>درواقع شبکه اینترنت عادی، اطلاعات به&zwnj;صورت متمرکز در یک سرور اصلی ذخیره می شوند که توسط هکرها و نهادهای ذیربط قابل دسترسی و ردیابی هستند این در حالی است که اطلاعات منتقل شده در شبکه بلاکی امکان دسترسی، نفوذ و ردیابی را به هیچ نهاد و یا فرد حقیقی و حقوقی نمی دهند. بلاکچین نوع جدید و خاصی از شبکه اینترنتی است که درآن اطلاعات مختلف به&zwnj;صورت بلاک های هم شکل طبقه بندی می شوند.</p>\r\n\r\n<h2>بلاکچین چگونه کار می کند؟</h2>\r\n\r\n<p>یک بلاک شامل یکسری داده، هش بلاک و هش بلاک قبلی است.  داده: داده های ذخیره شده به نوع بلاکچین بستگی دارد. مثلاً مشخصات گیرنده، فرستنده و میزان اطلاعات و... است.  هش بلاک:هر بلاک یک هش دارد، هش برای بلاک مثل اثر انگشت برای آدم ها است. هر هش مشخصات دقیق اون بلاک و محتوا اون بلاک را مشخص می کند و منحصر به فرد است.  هش بلاک قبلی: در ایجاد و ذخیره بلاک ها مؤثر است و باعث می شود فرآیند بلاک ها امن باقی بماند هر بلاک شامل یک هش و هش قبلی هست. بلاک اول که هش قبلی ندارد به نام genesis block(بلاک اولیه) می نامند. اگر هر بلاکی تغییر کند هش اون بلاک هم تغییر می کند هیچ کدام از بلاک های بعداز اون معتبر نیست چون هشی که از بلاک قبلی به&zwnj; دست می رسد معتبر نیست درنتیجه هرکدام از بلاک ها کوچک ترین تغییری کند، بلاک های بعد از آن نامعتبر می شود. برای جلوگیری از دست کاری فقط استفاده از هش کافی نیست امروزه کامپیوتر ها خیلی سریع هستند و می توانند صدها هزار هش را محاسبه کند و این امکان وجود دارد که یک بلاک را تغییر بدهند و هش تمام بلاک ها عوض شود وجود دارد تا بلاکچین مجدداً معتبر کند.</p>\r\n\r\n<h2>مزایای بلاکچین</h2>\r\n\r\n<p>1. دقت و امنیت در زنجیره بلوک ها به شدت بالا است. چون معاملات در شبکه بلاکچین توسط شبکه ای از هزاران رایانه تأیید می شود. 2. بلاکچین نیازی به تأیید شخص ثالث و همراه آن هزینه های مربوط به آنها را از بین می برد. 3. بلاکچین 24 ساعته، هفت روز هفته و 365 روز در سال کار می کند. معاملات را می توان در کمتر از ده دقیقه انجام داد و تنها پس از چند ساعت ایمن در نظر گرفت. 4. بیشتر بلاکچین ها کاملاً نرم افزاری متن باز هستند. این بدان معنی است که هرکس و همه می توانند کد آن را مشاهده کنند.</p>\r\n\r\n<h2>کاربرد های بلاکچین</h2>\r\n\r\n<p>1. ارز دیجیتال (Digital Currency): ارز دیجیتال نوع خاصی از پول دیجیتال است که بر پایه علم رمزنگاری ایجاد شده است. بیشتر ارزهای دیجیتال برای بهره&zwnj;مند شدن از ویژگی های اساسی مانند غیرمتمرکز بودن، شفافیت و تغییرناپذیر بودن از بلاکچین استفاده می کنند. مثل بیت کوین ،اتریم،ریپل،ترون و.... 2. قرارداد هوشمند (Smart Contracts): درست مثل قراردادهای عادی در دنیای واقعی است با این تفاوت این قراردادها کاملاً دیجیتال هستند و برای نگهداری از یک دفتر کل توزیع شده استفاده می کنند. در واقع یک قرارداد هوشمند یک نرم افزار کوچک است که در بلاکچین قرار دارد. 3. اوراق بهادار (Securities): برای جلوگیری از دسترسی و هک کردن اطلاعات بورس در تلاش هستند که از فناوری بلاکچین استفاده کنند؛ مانند کشور ژاپن و استرالیا. 4. ثبت و نگهداری سوابق (Record Keeping): یکی از کاربردی ترین موضوعاتی که در بلاکچین پیشرفت زیادی خواهد کرد ثبت و نگهداری از سوابق هست. این امکان را می دهد که سوابق را بتوانم به&zwnj; صورتی دائمی، ایمن و غیرقابل تغییر بر روی شبکه ای همتا به همتا ذخیره کرد. 5. اینترنت اشیا (Internet of things): ذخیره سازی امن اطلاعات و دیتاهای جمع آوری &zwnj;شده در اینترنت اشیا متنی بر سیستم بلاکی برای حفظ امنیت بیشتر و قابل دسترس نبودن اطلاعات است. 6. رای گیری های دیجیتال: یک سیستم رأی گیری مبتنی بر بلاکچین از شفافیت بالایی برخوردار است چون همه می توانند تعداد آرا را برای خودشان شمارش کنند، بدین ترتیب احتمال وقوع تقلب و دست کاری در سیستم پایین می آید. 7. زنجیره تامین(supply chain): در یک دفتر کل توزیع شده اشتراکی راه اندازی می شود و سوابقی غیرقابل&zwnj; انکار از همه داده های مربوط به وضعیت حمل&zwnj; و نقل، وضعیت وسایل نقلیه بارکش، شرایط محیطی انبارها و غیر را ثبت می کند.</p>\r\n\r\n<h2>سخن پایانی</h2>\r\n\r\n<p>با توجه به پیشرفت و قابلیت های زیادی که تکنولوژی مبتنی بر سیستم بلاک به عنوان یک سیستم غیر متمرکز با امنیت بالا و شفافیت است، آشنایی با این تکنولوژی یکی از اصول و مفاهیم پایه برای ورود به دنیای دیجیتال وبهره وری از آن می باشد. افراد و شرکت ها می توانند با بهره گیری با این تکنولوژی امن و در عین حال پیچیده و غیر قابل تغییر به تبادلات بانکی، مالی، اسناد مالیکیت، اطلاعاتی علمی، قرارها و پیام های شخصی بپردارند.</p>\r\n', '1644612506bitcoin.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `contacts`
--

CREATE TABLE `contacts` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `email` varchar(50) NOT NULL,
  `phone` varchar(15) NOT NULL,
  `message` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `contacts`
--

INSERT INTO `contacts` (`id`, `name`, `email`, `phone`, `message`) VALUES
(76, 'مجید حسینی', 'majid@gmail.com', '09378966558', 'بسیار عالی و مفید'),
(77, 'جواد علیزاده', 'javad34@gmail.com', '09155699878', 'بسیار ممنون و سپاسگزارم\nمطالب خیلی کامل بودن'),
(79, 'فاطمه موسوی', 'fati@gmail.com', '09218766332', 'سلام ممنون از مطالب خوبتون'),
(86, 'اکبر صادقی', 'akbar33@gmail.com', '09911555478', 'لطفا درمورد دوج کوین هم اطلاعاتی قرار دهید \nمرسی');

-- --------------------------------------------------------

--
-- Table structure for table `courses`
--

CREATE TABLE `courses` (
  `id` int(11) NOT NULL,
  `title` varchar(30) NOT NULL,
  `description` varchar(200) NOT NULL,
  `image` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `courses`
--

INSERT INTO `courses` (`id`, `title`, `description`, `image`) VALUES
(9, 'آموزش فناوری بلاکچین', 'دوره 20 جلسه ای با موضوع بلاکچین و کیف پول ارزهای دیجیتال و رمز ارزها\r\n\r\n', '1644432066blockchain.jpg'),
(10, 'کسب درآمد از اتریوم', 'دوره 30 جلسه ای با آموزش تخصصی استخراج اتریوم و قرارداد هوشمند\r\n\r\n', '1644432098ethereum1.jpg'),
(11, 'کسب درآمد از بیت کوین', 'دوره 30 جلسه ای با آموزش حرفه ای استخراج و ماین بیت کوین با استفاده از چند نرم افزار مختلف\r\n\r\n', '1644432169bitcoin.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `login`
--

CREATE TABLE `login` (
  `id` int(11) NOT NULL,
  `username` varchar(70) NOT NULL,
  `password` varchar(70) NOT NULL,
  `access` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `login`
--

INSERT INTO `login` (`id`, `username`, `password`, `access`) VALUES
(1, 'mahmoodi', '8cb2237d0679ca88db6464eac60da96345513964', 1);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `fullName` varchar(60) NOT NULL,
  `phoneNumber` varchar(11) NOT NULL,
  `email` varchar(50) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `users_course`
--

CREATE TABLE `users_course` (
  `id` int(11) NOT NULL,
  `username` varchar(50) DEFAULT NULL,
  `course_id` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `articles`
--
ALTER TABLE `articles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contacts`
--
ALTER TABLE `contacts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `courses`
--
ALTER TABLE `courses`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `login`
--
ALTER TABLE `login`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users_course`
--
ALTER TABLE `users_course`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `articles`
--
ALTER TABLE `articles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `contacts`
--
ALTER TABLE `contacts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=91;

--
-- AUTO_INCREMENT for table `courses`
--
ALTER TABLE `courses`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `login`
--
ALTER TABLE `login`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `users_course`
--
ALTER TABLE `users_course`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
